victor/constant/regionProperties
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"constant";
	object	regionProperties;
}
regions	(
	fluid	(Region_one)
	solid	(Region_two)
);
