victor/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

gradSchemes
{
}

divSchemes
{
}

laplacianSchemes
{
}
