victor/system/snappyHexMeshDict
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          snappyHexMeshDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.0
// Source file:
// Export date: 2022-08-08 08:15:01.281343

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{


    refine //Write your geometry name here
    {
        type triSurfaceMesh;    // Dr. Victor you can add stl files here.
        file "Cylinder.stl";

    }
}

castellatedMeshControls
{
    maxLocalCells   10000000;
    maxGlobalCells  10000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.1;
    nCellsBetweenLevels 4;
    locationInMesh (0.5 0.5 0.1);
    allowFreeStandingZoneFaces true;
    resolveFeatureAngle 30;
    features
    (
        {
            file "Cylinder.eMesh";   //then add your geometry name.eMesh
            level 0;
        }

    );
    refinementSurfaces
    {
        Cylinder    // write your geometry name here.
        {
            level (6 6);
            patchInfo { type wall; }
        }

    }
    refinementRegions
    {

    }
}

snapControls
{
    nSmoothPatch    5;
    tolerance       1;
    nSolveIter      500;
    nRelaxIter      10;
    nFeatureSnapIter 10;
    implicitFeatureSnap true;
    explicitFeatureSnap true;
    multiRegionFeatureSnap true;
}

addLayersControls
{
relativeSizes	true;
minThickness	0.1;
firstLayerThickness	0.2;
expansionRatio	1.25;
nGrow	0;
featureAngle	180.0;
maxFaceThicknessRatio	0.5;
nSmoothSurfaceNormals	5;
nSmoothThickness	10;
minMedialAxisAngle	90.0;
maxThicknessToMedialRatio	0.5;
nMedialAxisIter	100;
nSmoothNormals	3;
slipFeatureAngle	30.0;
nRelaxIter	5;
nBufferCellsNoExtrude	0;
nLayerIter	50;
nRelaxedIter	20;
detectExtrusionIsland	true;
    layers
    {
      

    }
}

meshQualityControls
{
    maxNonOrtho     65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave      80;
    minVol          1e-15;
    minTetQuality   1e-15;
    minArea         -1;
    minTwist        0.02;
    minDeterminant  0.001;
    minFaceWeight   0.05;
    minVolRatio     0.01;
    minTriangleTwist -1;
    nSmoothScale    4;
    errorReduction  0.75;
    relaxed
  	{
  		maxNonOrtho	75.0;
  	}

}

writeFlags      ( scalarLevels layerSets layerFields );

mergeTolerance  1e-06;
