victor/system/surfaceFeatureExtractDict
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          surfaceFeaturesDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.0
// Source file: 
// Export date: 2022-12-05 21:48:05.654191


Cylinder.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 180; }

}



